app/views/posts/_form.html.erb

    <%= f.label :autor_id %><br>
    <%= collection_select(:post, :autor_id, Autor.all, :id, :nombre, {:prompt => 'seleccione autor'},class:"form-control") %>
---
SELECT "autors".* FROM "autors"