app/controllers/posts_controller.rb

  def create
    @post= Post.create(parametros)
---
INSERT INTO "posts" ("autor_id", "created_at", "estado", "fecha", "texto", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["autor_id", 1], ["created_at", "2014-12-04 04:07:37.232705"], ["estado", "f"], ["fecha", "2014-12-12"], ["texto", "ss"], ["titulo", "sss"], ["updated_at", "2014-12-04 04:07:37.232705"]]

  def update
     @post= Post.update(params[:id],parametros)
---
UPDATE "posts" SET "texto" = ?, "titulo" = ?, "updated_at" = ? WHERE "posts"."id" = 31  [["texto", "ddddd"], ["titulo", "ultimo post"], ["updated_at", "2014-12-04 21:58:23.623840"]]

  def destroy

    @post=Post.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]